chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_app/source/misc.c
/******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co.,Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co.,Ltd ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file misc.c
 **
 ** A detailed description is available at
 ** @link
        This file includes misc I/F for goodix app.
    @endlink
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32_ddl.h"
#include "misc.h"

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/
/* SPI_SCK Port/Pin definition */
#define SPI_SCK_PORT                    (PortB)
#define SPI_SCK_PIN                     (Pin13)
#define SPI_SCK_FUNC                    (Func_Spi3_Sck)

/* SPI_MOSI Port/Pin definition */
#define SPI_MOSI_PORT                   (PortB)
#define SPI_MOSI_PIN                    (Pin15)
#define SPI_MOSI_FUNC                   (Func_Spi3_Mosi)

/* SPI_MISO Port/Pin definition */
#define SPI_MISO_PORT                   (PortB)
#define SPI_MISO_PIN                    (Pin14)
#define SPI_MISO_FUNC                   (Func_Spi3_Miso)

/* SPI unit and clock definition */
#define SPI_UNIT_CLOCK                  (PWC_FCG1_PERIPH_SPI3)

#define SPI_DUMMY_BYTE_VALUE            (0xffu)

#define SPI_DMA_TX_UNIT                 (M4_DMA1)
#define SPI_DMA_TX_CH                   (DmaCh0)
#define SPI_MASTER_DMA_TX_IRQn          (Int000_IRQn)
#define SPI_MASTER_DMA_TX_INT_SRC       (INT_DMA1_TC0)
#define SPI_DMA_TX_TRIG_SOURCE          (EVT_SPI3_SPTI)

#define SPI_DMA_RX_UNIT                 (M4_DMA1)
#define SPI_DMA_RX_CH                   (DmaCh1)
#define SPI_MASTER_DMA_RX_IRQn          (Int001_IRQn)
#define SPI_MASTER_DMA_RX_INT_SRC       (INT_DMA1_TC1)
#define SPI_DMA_RX_TRIG_SOURCE          (EVT_SPI3_SPRI)

#define DP_PORT                         (PortA)
#define DP_PIN                          (Pin12)
#define DP_EXINT_CH                     (ExtiCh12)
#define DP_INT_IRQn                     (Int002_IRQn)
#define DP_INT_SRC                      (INT_PORT_EIRQ12)

#define DM_PORT                         (PortA)
#define DM_PIN                          (Pin11)
#define DM_EXINT_CH                     (ExtiCh11)
#define DM_INT_IRQn                     (Int003_IRQn)
#define DM_INT_SRC                      (INT_PORT_EIRQ11)

#define EC_PORT                         (PortA)
#define EC_PIN                          (Pin05)
#define EC_EXINT_CH                     (ExtiCh05)
#define EC_INT_IRQn                     (Int004_IRQn)
#define EC_INT_SRC                      (INT_PORT_EIRQ5)

#define FP_PORT                         (PortA)
#define FP_PIN                          (Pin00)
#define FP_EXINT_CH                     (ExtiCh00)
#define FP_INT_IRQn                     (Int005_IRQn)
#define FP_INT_SRC                      (INT_PORT_EIRQ0)
////////////////////////////////////////////////////////////////////////

/* USART channel definition */
#define USART_UNIT                      (M4_USART4)
#define USART_UNIT_CLOCK                (PWC_FCG1_PERIPH_USART4)

/* USART baudrate definition */
//#define USART_BAUDRATE                  (3000000ul)

/* USART CK Port/Pin definition */
#define USART_CK_PORT                   (PortB)
#define USART_CK_PIN                    (Pin00)
#define USART_CK_FUNC                   (Func_Usart_Ck)
/* USART RX Port/Pin definition */
#define USART_RX_PORT                   (PortB)
#define USART_RX_PIN                    (Pin03)
#define USART_RX_FUNC                   (Func_Usart4_Rx)
/* USART TX Port/Pin definition */
#define USART_TX_PORT                   (PortB)
#define USART_TX_PIN                    (Pin04)
#define USART_TX_FUNC                   (Func_Usart4_Tx)

/* DMAC */
#define USART_TX_DMA_UNIT               (M4_DMA2)
#define USART_TX_DMA_CH                 (DmaCh0)
#define USART_TX_DMA_TRG_SEL            (EVT_USART4_TI)

#define USART_RX_DMA_UNIT               (M4_DMA2)
#define USART_RX_DMA_CH                 (DmaCh1)
#define USART_RX_DMA_TRG_SEL            (EVT_USART4_RI)

/* USART interrupt number  */
#define USART_EI_NUM                    (INT_USART4_EI)
#define USART_EI_IRQn                   (Int006_IRQn)

/* DMA block transfer complete interrupt */
#define TX_DMA_BTC_INT_NUM              (INT_DMA2_TC0)
#define TX_DMA_BTC_INT_IRQn             (Int007_IRQn)

#define RX_DMA_BTC_INT_NUM              (INT_DMA2_TC1)
#define RX_DMA_BTC_INT_IRQn             (Int008_IRQn)


