chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_app/source/misc.c
    PWC_Fcg0PeriphClockCmd(PWC_FCG0_PERIPH_AOS | PWC_FCG0_PERIPH_DMA1, Enable);

    /* Configure TX DMA */
    stcDmaCfg.u16BlockSize = 1u;
//    stcDmaCfg.u16TransferCnt = u16BufferLen;
    stcDmaCfg.u32SrcAddr = (uint32_t)(&SpiDummyByte);
    stcDmaCfg.u32DesAddr = (uint32_t)(&SPI_UNIT->DR);
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
    stcDmaCfg.stcDmaChCfg.enIntEn = Disable;
    DMA_InitChannel(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, &stcDmaCfg);

    /* Configure RX DMA */
    stcDmaCfg.u16BlockSize = 1u;
//    stcDmaCfg.u16TransferCnt = u16BufferLen;
    stcDmaCfg.u32SrcAddr = (uint32_t)(&SPI_UNIT->DR);
//    stcDmaCfg.u32DesAddr = (uint32_t)(&u8RxBuffer[0]);
    stcDmaCfg.stcDmaChCfg.enSrcInc = AddressFix;
    stcDmaCfg.stcDmaChCfg.enDesInc = AddressIncrease;
    stcDmaCfg.stcDmaChCfg.enTrnWidth = Dma8Bit;
    stcDmaCfg.stcDmaChCfg.enIntEn = Enable;
    DMA_InitChannel(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, &stcDmaCfg);

    DMA_SetTriggerSrc(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, SPI_DMA_TX_TRIG_SOURCE);
    DMA_SetTriggerSrc(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, SPI_DMA_RX_TRIG_SOURCE);

    /* interrupt */
//    stcIrqRegiConf.enIntSrc = SPI_MASTER_DMA_TX_INT_SRC;
//    stcIrqRegiConf.enIRQn = SPI_MASTER_DMA_TX_IRQn;
//    stcIrqRegiConf.pfnCallback = &SPI_TxCmplt;
//    enIrqRegistration(stcIrqRegiConf);
//    DMA_EnableIrq(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, TrnCpltIrq);

    stcIrqRegiConf.enIntSrc = SPI_MASTER_DMA_RX_INT_SRC;
    stcIrqRegiConf.enIRQn = SPI_MASTER_DMA_RX_IRQn;
    stcIrqRegiConf.pfnCallback = &SPI_RxCmplt;
    enIrqRegistration(&stcIrqRegiConf);
    DMA_EnableIrq(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, TrnCpltIrq);

//    HAL_NVIC_SetPriority(SPI_MASTER_DMA_TX_IRQn, 0, 1);
//    HAL_NVIC_EnableIRQ(SPI_MASTER_DMA_TX_IRQn);

    HAL_NVIC_SetPriority(SPI_MASTER_DMA_RX_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(SPI_MASTER_DMA_RX_IRQn);

    DMA_Cmd(SPI_DMA_TX_UNIT, Enable);
    DMA_Cmd(SPI_DMA_RX_UNIT, Enable);
}

/**
 *******************************************************************************
 ** \brief  Receive SPI data with DMA
 ** \param  [in] SPIx                   SPI Unit
 **              SPI_UNIT               SPI Master unit
 **              SPI_SLAVE_UNIT         SPI Slave unit
 ** \param  [in] pu8Data
 ** \param  [in] len
 ** \retval None
 ******************************************************************************/
en_result_t HAL_SPI_Receive_DMA(const M4_SPI_TypeDef *SPIx, uint8_t pu8Data[], uint16_t len)
{
    en_result_t enRet = Ok;
    stc_dma_ch_cfg_t stcDmaChCfg;

    if ((NULL == SPIx) || (NULL == pu8Data))
    {
        enRet = ErrorInvalidParameter;
    }
    else if(SPI_UNIT == SPIx)
    {
        /* SPI master data receive */
        SPI_Cmd(SPI_UNIT, Disable);
//        DMA_SetSrcAddress(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, &SpiDummyByte);
//        DMA_SetDesAddress(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, (uint32_t)&SPIx->DR);
        DMA_SetTransferCnt(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, len);
        DMA_SetTransferCnt(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, len);

//        DMA_SetSrcAddress(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, (uint32_t)&SPIx->DR);
        DMA_SetDesAddress(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, (uint32_t)pu8Data);

        DMA_ChannelCmd(SPI_DMA_RX_UNIT, SPI_DMA_RX_CH, Enable);
        DMA_ChannelCmd(SPI_DMA_TX_UNIT, SPI_DMA_TX_CH, Enable);

        SPI_Cmd(SPI_UNIT, Enable);
    }
    //else if(SPI_SLAVE_UNIT == SPIx)
    else
    {
        MEM_ZERO_STRUCT(stcDmaChCfg);

         /* DMA src and des inc config */
        stcDmaChCfg.enSrcInc = AddressFix;
        stcDmaChCfg.enDesInc = AddressIncrease;
        stcDmaChCfg.enTrnWidth = Dma8Bit;
        stcDmaChCfg.enIntEn = Enable;
        DMA_ChannelCfg(USART_RX_DMA_UNIT, USART_RX_DMA_CH, &stcDmaChCfg);

        /* SPI slave data receive */
        //SPI_Cmd(SPI_SLAVE_UNIT, Disable);

        DMA_SetTransferCnt(USART_RX_DMA_UNIT, USART_RX_DMA_CH, len);
        DMA_SetDesAddress(USART_RX_DMA_UNIT, USART_RX_DMA_CH, (uint32_t)pu8Data);

        DMA_ChannelCmd(USART_RX_DMA_UNIT, USART_RX_DMA_CH, Enable);

        USART_FuncCmd(USART_UNIT, UsartTxAndTxEmptyInt, Disable);
        USART_FuncCmd(USART_UNIT, UsartRx, Enable);
        USART_FuncCmd(USART_UNIT, UsartRxInt, Enable);
    }
    //else
    //{
    //    enRet = ErrorInvalidParameter;
    //}

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Transmit SPI data with DMA
 ** \param  [in] SPIx                   SPI Unit
 **              SPI_SLAVE_UNIT         SPI Slave unit
 ** \param  [in] pu8Data
 ** \param  [in] len
 ** \retval None
 ******************************************************************************/
en_result_t HAL_SPI_Transmit_DMA(const M4_SPI_TypeDef *SPIx, uint8_t pu8Data[], uint16_t len)
{
    en_result_t enRet = Ok;
    stc_dma_ch_cfg_t stcDmaChCfg;

    if ((NULL == SPIx) || (NULL == pu8Data))
    {
        enRet = ErrorInvalidParameter;
    }
    //else if(SPI_UNIT == SPIx)
    //{
    //    /* SPI master data receive */
    //
    //}
    //else if(SPI_SLAVE_UNIT == SPIx)
    else
    {
        MEM_ZERO_STRUCT(stcDmaChCfg);
        /* DMA src and des inc config */
        stcDmaChCfg.enSrcInc = AddressIncrease;
        stcDmaChCfg.enDesInc = AddressFix;
        stcDmaChCfg.enTrnWidth = Dma8Bit;
        stcDmaChCfg.enIntEn = Enable;
        DMA_ChannelCfg(USART_TX_DMA_UNIT, USART_TX_DMA_CH, &stcDmaChCfg);

        /* SPI slave data receive */
        DMA_SetSrcAddress(USART_TX_DMA_UNIT, USART_TX_DMA_CH, (uint32_t)pu8Data);

        DMA_SetTransferCnt(USART_TX_DMA_UNIT, USART_TX_DMA_CH, len);
        DMA_ChannelCmd(USART_TX_DMA_UNIT, USART_TX_DMA_CH, Enable);

        USART_FuncCmd(USART_UNIT, UsartRx, Disable);
        USART_FuncCmd(USART_UNIT, UsartRxInt, Disable);
        /*Enable TX interupt function*/
        USART_FuncCmd(USART_UNIT, UsartTxAndTxEmptyInt, Enable);
    }
    //else
    //{
    //    enRet = ErrorInvalidParameter;
    //}

    return enRet;
}

/**
 *******************************************************************************
 ** \brief  Callback function for DP wakeup
 ** \param  None
 ** \retval None
 ******************************************************************************/
void USB_DP_ExintCallback(void)
{
    /* add your code here */
    HAL_NVIC_DisableIRQ(DP_INT_IRQn);
    EXINT_IrqFlgClr(DP_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Callback function for DM wakeup
 ** \param  None
 ** \retval None
 ******************************************************************************/
void USB_DM_ExintCallback(void)
{
    /* add your code here */
    HAL_NVIC_DisableIRQ(DM_INT_IRQn);
    EXINT_IrqFlgClr(DM_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Callback function for EC exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void EC_ExintCallback(void)
{
    /* add your code here */
    EXINT_IrqFlgClr(EC_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Callback function for FP exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void FP_ExintCallback(void)
{
    /* add your code here */
    EXINT_IrqFlgClr(FP_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Exint configure for DP DM wakeup from stop mode
 ** \param  None
 ** \retval None
 ** \note   Call before enter stop mode
 ******************************************************************************/
//void USB_DPDMWakeupConfig(void)
//{
//    stc_exint_config_t stcExtiConfig;
//    stc_irq_regi_conf_t stcIrqRegiConf;
//    stc_port_init_t stcPortInit;
//
//    /* GPIO input and exint enable */
//    MEM_ZERO_STRUCT(stcPortInit);
//    stcPortInit.enPinMode = Pin_Mode_In;
//    stcPortInit.enExInt = Enable;
//    PORT_Init(DP_PORT, DP_PIN, &stcPortInit);  /* DP */
//    PORT_Init(DM_PORT, DM_PIN, &stcPortInit);  /* DM */
//
//    /* Exint config */
//    stcExtiConfig.enExitCh = DP_EXINT_CH;
//    stcExtiConfig.enFilterEn = Enable;
//    stcExtiConfig.enFltClk = Pclk3Div8;
//    stcExtiConfig.enExtiLvl = ExIntBothEdge;
//    EXINT_Init(&stcExtiConfig);
//    stcExtiConfig.enExitCh = DM_EXINT_CH;
//    EXINT_Init(&stcExtiConfig);
//
//    /* Select External Int Ch.12 */
//    stcIrqRegiConf.enIntSrc = DP_INT_SRC;
//    stcIrqRegiConf.enIRQn = DP_INT_IRQn;
//    stcIrqRegiConf.pfnCallback = &USB_DP_ExintCallback;
//    enIrqRegistration(&stcIrqRegiConf);
////    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
////    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
////    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 1, 0);
//    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//
//    /* Select External Int Ch.11 */
//    stcIrqRegiConf.enIntSrc = DM_INT_SRC;
//    stcIrqRegiConf.enIRQn = DM_INT_IRQn;
//    stcIrqRegiConf.pfnCallback = &USB_DM_ExintCallback;
//    enIrqRegistration(&stcIrqRegiConf);
////    NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
////    NVIC_SetPriority(stcIrqRegiConf.enIRQn, DDL_IRQ_PRIORITY_15);
////    NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 1, 0);
//    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//
//    /* Enbale exint ch11 and ch12 wakeup from stop mode */
//    enIntWakeupEnable(Extint12WU | Extint11WU);
//}

/**
 *******************************************************************************
 ** \brief  Exint configure for DP DM wakeup from stop mode
 ** \param  None
 ** \retval None
 ** \note   Call after wakeup from stop mode
 ******************************************************************************/
//void USB_DPDM_PortInit(void)
//{
//    stc_port_init_t stcPortInit;
//
//    MEM_ZERO_STRUCT(stcPortInit);
//    stcPortInit.enPinMode = Pin_Mode_Ana;
//    PORT_Init(DP_PORT, DP_PIN, &stcPortInit);
//    PORT_Init(DM_PORT, DM_PIN, &stcPortInit);
//
//    /* un-gate USB Core clock */
//    USB_OTG_EnableUSBCoreClock(&USB_OTG_dev);
//}

/**
 *******************************************************************************
 ** \brief  Exint configure for EC pin
 ** \param  None
 ** \retval None
 ******************************************************************************/
void EcIntConfig(void)
{
    stc_exint_config_t stcExtiConfig;
    stc_irq_regi_conf_t stcIrqRegiConf;
    stc_port_init_t stcPortInit;

