chengy2/goodix_hdsc_spi/hc32f46x_ddl_Rev1.1.1/example/spi/spi_fp_app/source/misc.c
    HAL_NVIC_SetPriority(TX_DMA_BTC_INT_IRQn, 0, 1);
    HAL_NVIC_EnableIRQ(TX_DMA_BTC_INT_IRQn);

    HAL_NVIC_SetPriority(RX_DMA_BTC_INT_IRQn, 0, 0);
    HAL_NVIC_EnableIRQ(RX_DMA_BTC_INT_IRQn);

    DMA_Cmd(USART_TX_DMA_UNIT, Enable);
    DMA_Cmd(USART_RX_DMA_UNIT, Enable);
}

/**
 *******************************************************************************
 ** \brief USART RX error irq callback function.
 **
 ** \param [in] None
 **
 ** \retval None
 **
 ******************************************************************************/
static void UsartErrIrqCallback(void)
{
    //m_enTestResult = Error;

    if (Set == USART_GetStatus(USART_UNIT, UsartFrameErr))
    {
        USART_ClearStatus(USART_UNIT, UsartFrameErr);
    }
    else
    {
    }

    if (Set == USART_GetStatus(USART_UNIT, UsartParityErr))
    {
        USART_ClearStatus(USART_UNIT, UsartParityErr);
    }
    else
    {
    }

    if (Set == USART_GetStatus(USART_UNIT, UsartOverrunErr))
    {
        USART_ClearStatus(USART_UNIT, UsartOverrunErr);
    }
    else
    {
    }
}

/**
 *******************************************************************************
 ** \brief  SPI slave init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SlaveSpiInit(void)
{
    stc_irq_regi_conf_t stcIrqRegiCfg;
    const stc_usart_clksync_init_t stcInitCfg = {
        UsartExtClk,
        UsartClkDiv_1,
        UsartDataMsbFirst,
        UsartRtsEnable,
    };

    UsartDmaInit();

     /* Enable peripheral clock */
    PWC_Fcg1PeriphClockCmd(USART_UNIT_CLOCK, Enable);
    /* Initialize USART IO */
    PORT_DebugPortSetting(TDO_SWO, Disable);
    PORT_DebugPortSetting(TRST, Disable);
    PORT_SetFunc(USART_CK_PORT, USART_CK_PIN, USART_CK_FUNC, Disable);
    PORT_SetFunc(USART_RX_PORT, USART_RX_PIN, USART_RX_FUNC, Disable);
    PORT_SetFunc(USART_TX_PORT, USART_TX_PIN, USART_TX_FUNC, Disable);

    /* Initialize USART */
    USART_CLKSYNC_Init(USART_UNIT, &stcInitCfg);
    //USART_SetBaudrate(USART_UNIT, USART_BAUDRATE);

    /* Set USART RX error IRQ */
    stcIrqRegiCfg.enIRQn = USART_EI_IRQn;
    stcIrqRegiCfg.pfnCallback = &UsartErrIrqCallback;
    stcIrqRegiCfg.enIntSrc = USART_EI_NUM;
    enIrqRegistration(&stcIrqRegiCfg);
    NVIC_SetPriority(stcIrqRegiCfg.enIRQn, DDL_IRQ_PRIORITY_DEFAULT);
    NVIC_ClearPendingIRQ(stcIrqRegiCfg.enIRQn);
    NVIC_EnableIRQ(stcIrqRegiCfg.enIRQn);

    /*Enable RX && RX interupt function*/
    //USART_FuncCmd(USART_UNIT, UsartRx, Enable);
    //USART_FuncCmd(USART_UNIT, UsartRxInt, Enable);
}

/**
 *******************************************************************************
 ** \brief  SPI slave de-init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SlaveSpiDeInit(void)
{
//    SPI_DeInit(SPI_SLAVE_UNIT);
//
//    PORT_SetFunc(SPI_SLAVE_SCK_PORT, SPI_SLAVE_SCK_PIN, Func_Gpio, Disable);
//    PORT_SetFunc(SPI_SLAVE_MOSI_PORT, SPI_SLAVE_MOSI_PIN, Func_Gpio, Disable);
//    PORT_SetFunc(SPI_SLAVE_MISO_PORT, SPI_SLAVE_MISO_PIN, Func_Gpio, Disable);
//    PORT_SetFunc(SPI_SLAVE_NSS_PORT, SPI_SLAVE_NSS_PIN, Func_Gpio, Disable);
//
//    DMA_DeInit(SPI_SLAVE_DMA_TX_UNIT, SPI_SLAVE_DMA_TX_CH);
//    DMA_DeInit(SPI_SLAVE_DMA_RX_UNIT, SPI_SLAVE_DMA_RX_CH);
//
//    HAL_NVIC_DisableIRQ(SPI_SLAVE_DMA_TX_IRQn);
//    HAL_NVIC_DisableIRQ(SPI_SLAVE_DMA_RX_IRQn);
}

/**
 *******************************************************************************
 ** \brief  MCU_CPU_IRQ pin init
 ** \param  None
 ** \retval None
 ******************************************************************************/
void MCU_CPU_IRQ_PinInit(void)
{
    stc_port_init_t stcPortInit;

    /* configuration structure initialization */
    MEM_ZERO_STRUCT(stcPortInit);

    stcPortInit.enPinMode = Pin_Mode_Out;
    PORT_Init(MCU_CPU_IRQ_PORT, MCU_CPU_IRQ_PIN, &stcPortInit);
}

/**
 *******************************************************************************
 ** \brief  Callback function for MOSI exint
 ** \param  None
 ** \retval None
 ******************************************************************************/
void MOSI_ExintCallback(void)
{
    /* add your code here */
//    EXINT_IrqFlgClr(SPI_SLAVE_MOSI_EXINT_CH);
}

/**
 *******************************************************************************
 ** \brief  Exint configure for SPI slave MOSI pin
 ** \param  None
 ** \retval None
 ******************************************************************************/
void SpiMosiIntConfig(void)
{
//    stc_exint_config_t stcExtiConfig;
//    stc_irq_regi_conf_t stcIrqRegiConf;
//    stc_port_init_t stcPortInit;
//
//    /* GPIO input and exint enable */
//    MEM_ZERO_STRUCT(stcPortInit);
//    stcPortInit.enPinMode = Pin_Mode_In;
//    stcPortInit.enExInt = Enable;
//    PORT_Init(SPI_SLAVE_MOSI_PORT, SPI_SLAVE_MOSI_PIN, &stcPortInit);
//
//    /* Exint config */
//    stcExtiConfig.enExitCh = SPI_SLAVE_MOSI_EXINT_CH;
//    stcExtiConfig.enFilterEn = Enable;
//    stcExtiConfig.enFltClk = Pclk3Div8;
//    stcExtiConfig.enExtiLvl = ExIntRisingEdge;  /* Rising edge */
//    EXINT_Init(&stcExtiConfig);
//
//    /* Select External Int Ch.11 */
//    stcIrqRegiConf.enIntSrc = SPI_SLAVE_MOSI_INT_SRC;
//    stcIrqRegiConf.enIRQn = SPI_SLAVE_MOSI_INT_IRQn;
//    stcIrqRegiConf.pfnCallback = &MOSI_ExintCallback;
//    enIrqRegistration(&stcIrqRegiConf);
//
//    HAL_NVIC_ClearPendingIRQ(stcIrqRegiConf.enIRQn);
//    HAL_NVIC_SetPriority(stcIrqRegiConf.enIRQn, 2, 0);
//    HAL_NVIC_EnableIRQ(stcIrqRegiConf.enIRQn);
//
//    /* Enable wakeup */
//    enIntWakeupEnable(Extint0WU);
}

/*******************************************************************************
 * EOF (not truncated)
 ******************************************************************************/
